contiki-os/contiki/cc26xxware/inc/hw_cpu_scs.h
// Field: [11]    SETENA11
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 11 (See EVENT:CPUIRQSEL11.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA11                                 0x00000800
#define CPU_SCS_NVIC_ISER0_SETENA11_BITN                            11
#define CPU_SCS_NVIC_ISER0_SETENA11_M                               0x00000800
#define CPU_SCS_NVIC_ISER0_SETENA11_S                               11

// Field: [10]    SETENA10
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 10 (See EVENT:CPUIRQSEL10.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA10                                 0x00000400
#define CPU_SCS_NVIC_ISER0_SETENA10_BITN                            10
#define CPU_SCS_NVIC_ISER0_SETENA10_M                               0x00000400
#define CPU_SCS_NVIC_ISER0_SETENA10_S                               10

// Field: [9]    SETENA9
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 9 (See EVENT:CPUIRQSEL9.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA9                                  0x00000200
#define CPU_SCS_NVIC_ISER0_SETENA9_BITN                             9
#define CPU_SCS_NVIC_ISER0_SETENA9_M                                0x00000200
#define CPU_SCS_NVIC_ISER0_SETENA9_S                                9

// Field: [8]    SETENA8
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 8 (See EVENT:CPUIRQSEL8.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA8                                  0x00000100
#define CPU_SCS_NVIC_ISER0_SETENA8_BITN                             8
#define CPU_SCS_NVIC_ISER0_SETENA8_M                                0x00000100
#define CPU_SCS_NVIC_ISER0_SETENA8_S                                8

// Field: [7]    SETENA7
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 7 (See EVENT:CPUIRQSEL7.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA7                                  0x00000080
#define CPU_SCS_NVIC_ISER0_SETENA7_BITN                             7
#define CPU_SCS_NVIC_ISER0_SETENA7_M                                0x00000080
#define CPU_SCS_NVIC_ISER0_SETENA7_S                                7

// Field: [6]    SETENA6
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 6 (See EVENT:CPUIRQSEL6.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA6                                  0x00000040
#define CPU_SCS_NVIC_ISER0_SETENA6_BITN                             6
#define CPU_SCS_NVIC_ISER0_SETENA6_M                                0x00000040
#define CPU_SCS_NVIC_ISER0_SETENA6_S                                6

// Field: [5]    SETENA5
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 5 (See EVENT:CPUIRQSEL5.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA5                                  0x00000020
#define CPU_SCS_NVIC_ISER0_SETENA5_BITN                             5
#define CPU_SCS_NVIC_ISER0_SETENA5_M                                0x00000020
#define CPU_SCS_NVIC_ISER0_SETENA5_S                                5

// Field: [4]    SETENA4
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 4 (See EVENT:CPUIRQSEL4.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA4                                  0x00000010
#define CPU_SCS_NVIC_ISER0_SETENA4_BITN                             4
#define CPU_SCS_NVIC_ISER0_SETENA4_M                                0x00000010
#define CPU_SCS_NVIC_ISER0_SETENA4_S                                4

// Field: [3]    SETENA3
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 3 (See EVENT:CPUIRQSEL3.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA3                                  0x00000008
#define CPU_SCS_NVIC_ISER0_SETENA3_BITN                             3
#define CPU_SCS_NVIC_ISER0_SETENA3_M                                0x00000008
#define CPU_SCS_NVIC_ISER0_SETENA3_S                                3

// Field: [2]    SETENA2
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 2 (See EVENT:CPUIRQSEL2.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA2                                  0x00000004
#define CPU_SCS_NVIC_ISER0_SETENA2_BITN                             2
#define CPU_SCS_NVIC_ISER0_SETENA2_M                                0x00000004
#define CPU_SCS_NVIC_ISER0_SETENA2_S                                2

// Field: [1]    SETENA1
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 1 (See EVENT:CPUIRQSEL1.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA1                                  0x00000002
#define CPU_SCS_NVIC_ISER0_SETENA1_BITN                             1
#define CPU_SCS_NVIC_ISER0_SETENA1_M                                0x00000002
#define CPU_SCS_NVIC_ISER0_SETENA1_S                                1

// Field: [0]    SETENA0
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 0 (See EVENT:CPUIRQSEL0.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER0_SETENA0                                  0x00000001
#define CPU_SCS_NVIC_ISER0_SETENA0_BITN                             0
#define CPU_SCS_NVIC_ISER0_SETENA0_M                                0x00000001
#define CPU_SCS_NVIC_ISER0_SETENA0_S                                0

//*****************************************************************************
//
// Register: CPU_SCS_O_NVIC_ISER1
//
//*****************************************************************************
// Field: [1]    SETENA33
//
// Writing 0 to this bit has no effect, writing 1 to this bit enables the interrupt
// number 33 (See EVENT:CPUIRQSEL33.EV for details). Reading the bit returns its
// current enable state.
#define CPU_SCS_NVIC_ISER1_SETENA33                                 0x00000002
#define CPU_SCS_NVIC_ISER1_SETENA33_BITN                            1
#define CPU_SCS_NVIC_ISER1_SETENA33_M                               0x00000002
#define CPU_SCS_NVIC_ISER1_SETENA33_S                               1

