contiki-os/contiki/cc26xxware/inc/hw_cpu_scs.h
// Field: [0]    CLRENA0
//
// Writing 0 to this bit has no effect, writing 1 to this bit disables the
// interrupt number  0 (See EVENT:CPUIRQSEL0.EV for details). Reading the bit
// returns its current enable state.
#define CPU_SCS_NVIC_ICER0_CLRENA0                                  0x00000001
#define CPU_SCS_NVIC_ICER0_CLRENA0_BITN                             0
#define CPU_SCS_NVIC_ICER0_CLRENA0_M                                0x00000001
#define CPU_SCS_NVIC_ICER0_CLRENA0_S                                0

//*****************************************************************************
//
// Register: CPU_SCS_O_NVIC_ICER1
//
//*****************************************************************************
// Field: [1]    CLRENA33
//
// Writing 0 to this bit has no effect, writing 1 to this bit disables the
// interrupt number  33 (See EVENT:CPUIRQSEL33.EV for details). Reading the bit
// returns its current enable state.
#define CPU_SCS_NVIC_ICER1_CLRENA33                                 0x00000002
#define CPU_SCS_NVIC_ICER1_CLRENA33_BITN                            1
#define CPU_SCS_NVIC_ICER1_CLRENA33_M                               0x00000002
#define CPU_SCS_NVIC_ICER1_CLRENA33_S                               1

// Field: [0]    CLRENA32
//
// Writing 0 to this bit has no effect, writing 1 to this bit disables the
// interrupt number  32 (See EVENT:CPUIRQSEL32.EV for details). Reading the bit
// returns its current enable state.
#define CPU_SCS_NVIC_ICER1_CLRENA32                                 0x00000001
#define CPU_SCS_NVIC_ICER1_CLRENA32_BITN                            0
#define CPU_SCS_NVIC_ICER1_CLRENA32_M                               0x00000001
#define CPU_SCS_NVIC_ICER1_CLRENA32_S                               0

//*****************************************************************************
//
// Register: CPU_SCS_O_NVIC_ISPR0
//
//*****************************************************************************
// Field: [31]    SETPEND31
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 31 (See EVENT:CPUIRQSEL31.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND31                                0x80000000
#define CPU_SCS_NVIC_ISPR0_SETPEND31_BITN                           31
#define CPU_SCS_NVIC_ISPR0_SETPEND31_M                              0x80000000
#define CPU_SCS_NVIC_ISPR0_SETPEND31_S                              31

// Field: [30]    SETPEND30
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 30 (See EVENT:CPUIRQSEL30.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND30                                0x40000000
#define CPU_SCS_NVIC_ISPR0_SETPEND30_BITN                           30
#define CPU_SCS_NVIC_ISPR0_SETPEND30_M                              0x40000000
#define CPU_SCS_NVIC_ISPR0_SETPEND30_S                              30

// Field: [29]    SETPEND29
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 29 (See EVENT:CPUIRQSEL29.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND29                                0x20000000
#define CPU_SCS_NVIC_ISPR0_SETPEND29_BITN                           29
#define CPU_SCS_NVIC_ISPR0_SETPEND29_M                              0x20000000
#define CPU_SCS_NVIC_ISPR0_SETPEND29_S                              29

// Field: [28]    SETPEND28
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 28 (See EVENT:CPUIRQSEL28.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND28                                0x10000000
#define CPU_SCS_NVIC_ISPR0_SETPEND28_BITN                           28
#define CPU_SCS_NVIC_ISPR0_SETPEND28_M                              0x10000000
#define CPU_SCS_NVIC_ISPR0_SETPEND28_S                              28

// Field: [27]    SETPEND27
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 27 (See EVENT:CPUIRQSEL27.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND27                                0x08000000
#define CPU_SCS_NVIC_ISPR0_SETPEND27_BITN                           27
#define CPU_SCS_NVIC_ISPR0_SETPEND27_M                              0x08000000
#define CPU_SCS_NVIC_ISPR0_SETPEND27_S                              27

// Field: [26]    SETPEND26
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 26 (See EVENT:CPUIRQSEL26.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND26                                0x04000000
#define CPU_SCS_NVIC_ISPR0_SETPEND26_BITN                           26
#define CPU_SCS_NVIC_ISPR0_SETPEND26_M                              0x04000000
#define CPU_SCS_NVIC_ISPR0_SETPEND26_S                              26

// Field: [25]    SETPEND25
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 25 (See EVENT:CPUIRQSEL25.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND25                                0x02000000
#define CPU_SCS_NVIC_ISPR0_SETPEND25_BITN                           25
#define CPU_SCS_NVIC_ISPR0_SETPEND25_M                              0x02000000
#define CPU_SCS_NVIC_ISPR0_SETPEND25_S                              25

// Field: [24]    SETPEND24
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 24 (See EVENT:CPUIRQSEL24.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND24                                0x01000000
#define CPU_SCS_NVIC_ISPR0_SETPEND24_BITN                           24
#define CPU_SCS_NVIC_ISPR0_SETPEND24_M                              0x01000000
#define CPU_SCS_NVIC_ISPR0_SETPEND24_S                              24

// Field: [23]    SETPEND23
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 23 (See EVENT:CPUIRQSEL23.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND23                                0x00800000
#define CPU_SCS_NVIC_ISPR0_SETPEND23_BITN                           23
#define CPU_SCS_NVIC_ISPR0_SETPEND23_M                              0x00800000
#define CPU_SCS_NVIC_ISPR0_SETPEND23_S                              23

// Field: [22]    SETPEND22
//
// Writing 0 to this bit has no effect, writing 1 to this bit pends the interrupt
// number 22 (See EVENT:CPUIRQSEL22.EV for details). Reading the bit returns its
// current state.
#define CPU_SCS_NVIC_ISPR0_SETPEND22                                0x00400000
#define CPU_SCS_NVIC_ISPR0_SETPEND22_BITN                           22
#define CPU_SCS_NVIC_ISPR0_SETPEND22_M                              0x00400000
#define CPU_SCS_NVIC_ISPR0_SETPEND22_S                              22

