contiki-os/contiki/cc26xxware/inc/hw_cpu_scs.h
// Field: [13]    MEMFAULTPENDED
//
// MemManage exception pending
// ENUMs:
// NOTPENDING           Exception is not active
// PENDING              Exception is pending.
//
#define CPU_SCS_SHCSR_MEMFAULTPENDED                                0x00002000
#define CPU_SCS_SHCSR_MEMFAULTPENDED_BITN                           13
#define CPU_SCS_SHCSR_MEMFAULTPENDED_M                              0x00002000
#define CPU_SCS_SHCSR_MEMFAULTPENDED_S                              13
#define CPU_SCS_SHCSR_MEMFAULTPENDED_NOTPENDING                     0x00000000
#define CPU_SCS_SHCSR_MEMFAULTPENDED_PENDING                        0x00002000

// Field: [12]    USGFAULTPENDED
//
// Usage fault pending
// ENUMs:
// NOTPENDING           Exception is not active
// PENDING              Exception is pending.
//
#define CPU_SCS_SHCSR_USGFAULTPENDED                                0x00001000
#define CPU_SCS_SHCSR_USGFAULTPENDED_BITN                           12
#define CPU_SCS_SHCSR_USGFAULTPENDED_M                              0x00001000
#define CPU_SCS_SHCSR_USGFAULTPENDED_S                              12
#define CPU_SCS_SHCSR_USGFAULTPENDED_NOTPENDING                     0x00000000
#define CPU_SCS_SHCSR_USGFAULTPENDED_PENDING                        0x00001000

// Field: [11]    SYSTICKACT
//
// SysTick active flag.
//
// 0x0: Not active
// 0x1: Active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_SYSTICKACT                                    0x00000800
#define CPU_SCS_SHCSR_SYSTICKACT_BITN                               11
#define CPU_SCS_SHCSR_SYSTICKACT_M                                  0x00000800
#define CPU_SCS_SHCSR_SYSTICKACT_S                                  11
#define CPU_SCS_SHCSR_SYSTICKACT_NOTACTIVE                          0x00000000
#define CPU_SCS_SHCSR_SYSTICKACT_ACTIVE                             0x00000800

// Field: [10]    PENDSVACT
//
// PendSV active
//
// 0x0: Not active
// 0x1: Active
#define CPU_SCS_SHCSR_PENDSVACT                                     0x00000400
#define CPU_SCS_SHCSR_PENDSVACT_BITN                                10
#define CPU_SCS_SHCSR_PENDSVACT_M                                   0x00000400
#define CPU_SCS_SHCSR_PENDSVACT_S                                   10

// Field: [8]    MONITORACT
//
// Debug monitor active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_MONITORACT                                    0x00000100
#define CPU_SCS_SHCSR_MONITORACT_BITN                               8
#define CPU_SCS_SHCSR_MONITORACT_M                                  0x00000100
#define CPU_SCS_SHCSR_MONITORACT_S                                  8
#define CPU_SCS_SHCSR_MONITORACT_NOTACTIVE                          0x00000000
#define CPU_SCS_SHCSR_MONITORACT_ACTIVE                             0x00000100

// Field: [7]    SVCALLACT
//
// SVCall active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_SVCALLACT                                     0x00000080
#define CPU_SCS_SHCSR_SVCALLACT_BITN                                7
#define CPU_SCS_SHCSR_SVCALLACT_M                                   0x00000080
#define CPU_SCS_SHCSR_SVCALLACT_S                                   7
#define CPU_SCS_SHCSR_SVCALLACT_NOTACTIVE                           0x00000000
#define CPU_SCS_SHCSR_SVCALLACT_ACTIVE                              0x00000080

// Field: [3]    USGFAULTACT
//
// UsageFault exception active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_USGFAULTACT                                   0x00000008
#define CPU_SCS_SHCSR_USGFAULTACT_BITN                              3
#define CPU_SCS_SHCSR_USGFAULTACT_M                                 0x00000008
#define CPU_SCS_SHCSR_USGFAULTACT_S                                 3
#define CPU_SCS_SHCSR_USGFAULTACT_NOTACTIVE                         0x00000000
#define CPU_SCS_SHCSR_USGFAULTACT_ACTIVE                            0x00000008

// Field: [1]    BUSFAULTACT
//
// BusFault exception active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_BUSFAULTACT                                   0x00000002
#define CPU_SCS_SHCSR_BUSFAULTACT_BITN                              1
#define CPU_SCS_SHCSR_BUSFAULTACT_M                                 0x00000002
#define CPU_SCS_SHCSR_BUSFAULTACT_S                                 1
#define CPU_SCS_SHCSR_BUSFAULTACT_NOTACTIVE                         0x00000000
#define CPU_SCS_SHCSR_BUSFAULTACT_ACTIVE                            0x00000002

// Field: [0]    MEMFAULTACT
//
// MemManage exception active
// ENUMs:
// NOTACTIVE            Exception is not active
// ACTIVE               Exception is active
//
#define CPU_SCS_SHCSR_MEMFAULTACT                                   0x00000001
#define CPU_SCS_SHCSR_MEMFAULTACT_BITN                              0
#define CPU_SCS_SHCSR_MEMFAULTACT_M                                 0x00000001
#define CPU_SCS_SHCSR_MEMFAULTACT_S                                 0
#define CPU_SCS_SHCSR_MEMFAULTACT_NOTACTIVE                         0x00000000
#define CPU_SCS_SHCSR_MEMFAULTACT_ACTIVE                            0x00000001

//*****************************************************************************
//
// Register: CPU_SCS_O_CFSR
//
//*****************************************************************************
// Field: [25]    DIVBYZERO
//
// When CCR.DIV_0_TRP (see Configuration Control Register on page 8-26) is
// enabled and an SDIV or UDIV instruction is used with a divisor of 0, this fault
// occurs The instruction is executed and the return PC points to it. If
// CCR.DIV_0_TRP is not set, then the divide returns a quotient of 0.
#define CPU_SCS_CFSR_DIVBYZERO                                      0x02000000
#define CPU_SCS_CFSR_DIVBYZERO_BITN                                 25
#define CPU_SCS_CFSR_DIVBYZERO_M                                    0x02000000
#define CPU_SCS_CFSR_DIVBYZERO_S                                    25

// Field: [24]    UNALIGNED
//
// When CCR.UNALIGN_TRP is enabled, and there is an attempt to make an unaligned
// memory access, then this fault occurs. Unaligned LDM/STM/LDRD/STRD instructions
// always fault irrespective of the setting of CCR.UNALIGN_TRP.
#define CPU_SCS_CFSR_UNALIGNED                                      0x01000000
#define CPU_SCS_CFSR_UNALIGNED_BITN                                 24
#define CPU_SCS_CFSR_UNALIGNED_M                                    0x01000000
#define CPU_SCS_CFSR_UNALIGNED_S                                    24

// Field: [19]    NOCP
//
// Attempt to use a coprocessor instruction. The processor does not support
// coprocessor instructions.
#define CPU_SCS_CFSR_NOCP                                           0x00080000
#define CPU_SCS_CFSR_NOCP_BITN                                      19
#define CPU_SCS_CFSR_NOCP_M                                         0x00080000
#define CPU_SCS_CFSR_NOCP_S                                         19

// Field: [18]    INVPC
//
// Attempt to load EXC_RETURN into PC illegally. Invalid instruction, invalid
// context, invalid value. The return PC points to the instruction that tried to set
// the PC.
//
#define CPU_SCS_CFSR_INVPC                                          0x00040000
#define CPU_SCS_CFSR_INVPC_BITN                                     18
#define CPU_SCS_CFSR_INVPC_M                                        0x00040000
#define CPU_SCS_CFSR_INVPC_S                                        18

// Field: [17]    INVSTATE
//
// Indicates an attempt to execute in an invalid EPSR state (e.g. after a BX type
// instruction has changed state). This includes state change after entry to or
// return from exception, as well as from inter-working instructions. Return PC
// points to faulting instruction, with the invalid state.
#define CPU_SCS_CFSR_INVSTATE                                       0x00020000
#define CPU_SCS_CFSR_INVSTATE_BITN                                  17
#define CPU_SCS_CFSR_INVSTATE_M                                     0x00020000
#define CPU_SCS_CFSR_INVSTATE_S                                     17

// Field: [16]    UNDEFINSTR
//
// This bit is set when the processor attempts to execute an undefined instruction.
// This is an instruction that the processor cannot decode. The return PC points to
// the undefined instruction.
#define CPU_SCS_CFSR_UNDEFINSTR                                     0x00010000
#define CPU_SCS_CFSR_UNDEFINSTR_BITN                                16
#define CPU_SCS_CFSR_UNDEFINSTR_M                                   0x00010000
#define CPU_SCS_CFSR_UNDEFINSTR_S                                   16

